Repository: CofficLab/Lumi
Catalog: Plugins/RClickPlugin/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hk

source: Add
zh_hans: 添加
zh_hk: 新增

source: Add New Template
zh_hans: 添加新模板
zh_hk: 新增新範本

source: Add Template
zh_hans: 添加模板
zh_hk: 新增範本

source: Cancel
zh_hans: 取消
zh_hk: 取消

source: Copy Path
zh_hans: 复制路径
zh_hk: 拷貝路徑

source: Default Content
zh_hans: 默认内容
zh_hk: 默認內容

source: Delete File
zh_hans: 删除文件
zh_hk: 刪除檔案

source: Delete Template
zh_hans: 删除模板
zh_hk: 刪除範本

source: Do Not Show Hidden Files
zh_hans: 不显示隐藏文件
zh_hk: 不顯示隱藏檔案

source: Enable 'New File' Submenu
zh_hans: 启用“新建文件”子菜单
zh_hk: 啟用“新建檔案”子選單

source: Enable Finder Extension
zh_hans: 启用 Finder 扩展
zh_hk: 啟用 Finder 擴充

source: Extension (e.g. py)
zh_hans: 后缀名 (例如 py)
zh_hk: 后缀名 (例如 py)

source: Extension can only contain letters, numbers, hyphen, or underscore
zh_hans: 扩展名只能包含字母、数字、连字符或下划线
zh_hk: 扩展名只能包含字母、数字、连字符或下划线

# Finder Extension Settings Path
source: System Settings → General → Login Items & Extensions → Finder Extensions
zh_hans: 系统设置 → 通用 → 登录项与扩展 → Finder 扩展
zh_hk: 系統設定 → 一般 → 登入項目與擴充功能 → Finder 擴充功能

# Finder Extension Settings Path (macOS 15+)
source: System Settings → General → Login Items & Extensions → Extensions → File Provider
zh_hans: 系统设置 → 通用 → 登录项与扩展 → 扩展 → 文件提供程序
zh_hk: 系統設定 → 一般 → 登入項目與擴充功能 → 擴充功能 → 檔案提供者

source: General Actions
zh_hans: 通用操作
zh_hk: 通用操作

source: Hide File
zh_hans: 隐藏文件
zh_hk: 隐藏檔案

source: Menu
zh_hans: 菜单
zh_hk: 選單

source: Name (e.g. Python Script)
zh_hans: 名称 (例如 Python Script)
zh_hk: 名称 (例如 Python Script)

source: New File
zh_hans: 新建文件
zh_hk: 新建檔案

source: New File Menu
zh_hans: 新建文件菜单
zh_hk: 新建檔案菜单

source: New File Submenu
zh_hans: 新建文件子菜单
zh_hk: 新建檔案子選單

source: Open in Terminal
zh_hans: 在终端中打开
zh_hk: 在終端中打开

source: Open in VS Code
zh_hans: 在 VS Code 中打开
zh_hk: 在 VS Code 中打开

source: Open System Settings
zh_hans: 打开系统设置
zh_hk: 打开系統設定

source: Preview
zh_hans: 预览
zh_hk: 預覽

source: Reset
zh_hans: 重置
zh_hk: 重置

source: Reset to Defaults
zh_hans: 恢复默认设置
zh_hk: 恢复默認設定

source: Right Click
zh_hans: 右键
zh_hk: 右键

source: Show Hidden Files
zh_hans: 显示隐藏文件
zh_hk: 顯示隐藏檔案

source: Template name cannot be empty or contain path separators
zh_hans: 模板名称不能为空或包含路径分隔符
zh_hk: 模板名称不能为空或包含路径分隔符

source: The right-click menu functionality requires the Finder extension to be enabled in System Settings.
zh_hans: 右键菜单功能需要先在系统设置中启用 Finder 扩展。
zh_hk: 右鍵菜单功能需要先在系統設定中啟用 Finder 擴充。

source: User Manual
zh_hans: 使用手册
zh_hk: 使用手冊

source: Overview
zh_hans: 概述
zh_hk: 概述

source: This manual covers the interface and basic operations of the Right Click plugin: enabling the Finder extension, switching right-click actions, and managing New File templates.
zh_hans: 本手册介绍右键的界面与基本操作:启用 Finder 扩展、开关右键菜单动作,以及管理新建文件模板。
zh_hk: 本手冊介紹右鍵的介面與基本操作:啟用 Finder 擴充功能、開關右鍵選單動作,以及管理新增檔案範本。

source: Interface
zh_hans: 界面说明
zh_hk: 介面說明

source: Enable Finder Extension card: the Open System Settings button for enabling the extension.
zh_hans: 「启用 Finder 扩展」卡片:提供「打开系统设置」按钮,用于启用扩展。
zh_hk: 「啟用 Finder 擴充功能」卡片:提供「打開系統設定」按鈕,用於啟用擴充功能。

source: General Actions card: a switch for each right-click action.
zh_hans: 「通用动作」卡片:每个右键动作一个开关。
zh_hk: 「一般動作」卡片:每個右鍵動作一個開關。

source: New File Menu card: the 'New File' submenu switch, the Add Template button, and the template list with a switch and a delete button on each row.
zh_hans: 「新建文件菜单」卡片:「新建文件」子菜单开关、「添加模板」按钮,以及每行带开关和删除按钮的模板列表。
zh_hk: 「新增檔案選單」卡片:「新增檔案」子選單開關、「新增範本」按鈕,以及每行帶開關和刪除按鈕的範本列表。

source: Reset card: restores the default configuration.
zh_hans: 「重置」卡片:恢复默认配置。
zh_hk: 「重設」卡片:還原預設設定。

source: Preview tab in the rail: a live preview of the Finder right-click menu.
zh_hans: 侧栏「预览」标签页:实时预览 Finder 右键菜单。
zh_hk: 側欄「預覽」標籤頁:即時預覽 Finder 右鍵選單。

source: Basic Operations
zh_hans: 基本操作
zh_hk: 基本操作

source: Click Open System Settings and enable the app's Finder extension.
zh_hans: 点击「打开系统设置」,在系统设置中启用本应用的 Finder 扩展。
zh_hk: 點擊「打開系統設定」,在系統設定中啟用本應用程式的 Finder 擴充功能。

source: In General Actions, turn the right-click actions on or off as needed.
zh_hans: 在「通用动作」中,按需开关各个右键动作。
zh_hk: 在「一般動作」中,按需開關各個右鍵動作。

source: In New File Menu, click Add Template and fill in the name, extension, and default content.
zh_hans: 在「新建文件菜单」中,点击「添加模板」,填写名称、扩展名和默认内容。
zh_hk: 在「新增檔案選單」中,點擊「新增範本」,填寫名稱、副檔名和預設內容。

source: Use the switch and the delete button on a template row to manage it.
zh_hans: 使用模板行上的开关和删除按钮管理该模板。
zh_hk: 使用範本行上的開關和刪除按鈕管理該範本。

source: Open the Preview tab in the rail to check the resulting menu.
zh_hans: 打开侧栏「预览」标签页,查看最终的菜单效果。
zh_hk: 開啟側欄「預覽」標籤頁,檢視最終的選單效果。

source: Notes
zh_hans: 注意事项
zh_hk: 注意事項

source: The right-click menu works only after the Finder extension is enabled in System Settings.
zh_hans: 只有在系统设置中启用 Finder 扩展后,右键菜单才会生效。
zh_hk: 只有在系統設定中啟用 Finder 擴充功能後,右鍵選單才會生效。

source: Reset restores all actions and templates to the defaults.
zh_hans: 重置会将所有动作和模板恢复为默认值。
zh_hk: 重設會將所有動作和範本還原為預設值。

source: Figure 1: Interface layout
zh_hans: 图 1 界面布局
zh_hk: 圖 1 介面說明

source: Core Capabilities
zh_hans: 核心能力
zh_hk: 核心能力

source: Where to Find It
zh_hans: 使用入口
zh_hk: 使用入口

source: Context menu
zh_hans: 右键菜单
zh_hk: 右鍵選單

source: Context Actions
zh_hans: 右键动作
zh_hk: 右鍵動作

source: Extra actions in the Finder right-click menu.
zh_hans: 访达右键菜单中的额外动作。
zh_hk: Finder 右鍵選單中的額外動作。

source: Create files from user-defined templates.
zh_hans: 根据自定义模板创建文件。
zh_hk: 根據自訂範本建立檔案。

source: Finder Extension
zh_hans: 访达扩展
zh_hk: Finder 延伸功能

source: A macOS extension enabled from System Settings.
zh_hans: 从系统设置启用的 macOS 扩展。
zh_hk: 從系統設定啟用的 macOS 延伸功能。

source: Templates
zh_hans: 模板
zh_hk: 範本

source: Define name, extension and default content.
zh_hans: 定义名称、扩展名与默认内容。
zh_hk: 定義名稱、副檔名與預設內容。

source: Live Preview
zh_hans: 实时预览
zh_hk: 即時預覽

source: Preview the resulting right-click menu.
zh_hans: 预览最终的右键菜单。
zh_hk: 預覽最終的右鍵選單。

source: Restore actions and templates to defaults.
zh_hans: 将动作与模板恢复为默认。
zh_hk: 將動作與範本恢復為預設。

source: Right Click tab in the sidebar
zh_hans: 侧边栏中的右键标签页
zh_hk: 側邊欄中的右鍵標籤頁

source: Settings → Right Click
zh_hans: 设置 → 右键
zh_hk: 設定 → 右鍵

source: Unhide File
zh_hans: 取消隐藏文件

source: Finder
zh_hans: 访达
